tests/assets/test_suites/w3c_wsdl20/messages/good/InOutComplexTypes-1G/axis-inout-complextypes-selftest.wsimsg

<?xml version="1.0" encoding="UTF-8"?>
<!-- https://dev.w3.org/2002/ws/desc/test-suite/messages/good/InOutComplexTypes-1G/axis-inout-complextypes-selftest.wsimsg -->
<!-- Copyright © 2008 - W3C, (MIT, ERCIM, Keio). All Rights Reserved. http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231 -->
<log timestamp="2006-07-06T10:32:49.356"
    xmlns="http://www.ws-i.org/testing/2004/07/log/"
    xmlns:wsi-monConfig="http://www.ws-i.org/testing/2004/07/monitorConfig/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <monitor version="1.0" releaseDate="2003-03-20">
    <implementer name="IBM" location=""/>
    <environment>
      <runtime name="Java(TM) 2 Runtime Environment, Standard Edition" version="1.5.0_06-b05"/>
      <operatingSystem name="Windows XP" version="5.1"/>
      <xmlParser name="Apache Xerces" version="Xerces-J 2.8.0"/>
    </environment>
    <wsi-monConfig:configuration>
    <wsi-monConfig:comment>Comment</wsi-monConfig:comment>
      <wsi-monConfig:logFile replace="true" location="URL">
      <wsi-monConfig:addStyleSheet href="null" type="null" />
    </wsi-monConfig:logFile>
      <wsi-monConfig:logDuration>600</wsi-monConfig:logDuration>
      <wsi-monConfig:cleanupTimeoutSeconds>3</wsi-monConfig:cleanupTimeoutSeconds>
      <wsi-monConfig:manInTheMiddle>
      </wsi-monConfig:manInTheMiddle>
    </wsi-monConfig:configuration>
  </monitor>

<messageEntry xsi:type="httpMessageEntry" ID="1" conversationID="1" type="request" timestamp="2006-07-06T10:31:57.261Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStringParam xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;Echo Me &lt;/echoStringParam&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>199.43.208.130:1151</senderHostAndPort>
<receiverHostAndPort>chathura.dyndns.ws:8080</receiverHostAndPort>
<httpHeaders>POST /axis2/services/Axis2SampleDocLitService HTTP/1.1&#xd;
User-Agent: Axis2&#xd;
SOAPAction: urn:echoString&#xd;
Host: chathura.dyndns.ws:8080&#xd;
Transfer-Encoding: chunked&#xd;
Content-Type: text/xml; charset=UTF-8&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="2" conversationID="1" type="response" timestamp="2006-07-06T10:31:57.431Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStringReturn xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;Echo Me &lt;/echoStringReturn&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>chathura.dyndns.ws:8080</senderHostAndPort>
<receiverHostAndPort>199.43.208.130:1151</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Server: Apache-Coyote/1.1&#xd;
Set-Cookie: JSESSIONID=367BC688CB59974BDD40426BD77C10B1; Path=/axis2&#xd;
Content-Type: text/xml;charset=UTF-8&#xd;
Transfer-Encoding: chunked&#xd;
Date: Thu, 06 Jul 2006 15:31:47 GMT&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="3" conversationID="2" type="request" timestamp="2006-07-06T10:32:02.148Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStringArrayParam xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;string&gt;value1&lt;/string&gt;&lt;string&gt;value2&lt;/string&gt;&lt;string&gt;value3&lt;/string&gt;&lt;/echoStringArrayParam&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>199.43.208.130:1152</senderHostAndPort>
<receiverHostAndPort>chathura.dyndns.ws:8080</receiverHostAndPort>
<httpHeaders>POST /axis2/services/Axis2SampleDocLitService HTTP/1.1&#xd;
User-Agent: Axis2&#xd;
SOAPAction: urn:echoStringArray&#xd;
Cookie: JSESSIONID=367BC688CB59974BDD40426BD77C10B1&#xd;
Host: chathura.dyndns.ws:8080&#xd;
Transfer-Encoding: chunked&#xd;
Content-Type: text/xml; charset=UTF-8&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="4" conversationID="2" type="response" timestamp="2006-07-06T10:32:02.328Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStringArrayReturn xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;string&gt;value1&lt;/string&gt;&lt;string&gt;value2&lt;/string&gt;&lt;string&gt;value3&lt;/string&gt;&lt;/echoStringArrayReturn&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>chathura.dyndns.ws:8080</senderHostAndPort>
<receiverHostAndPort>199.43.208.130:1152</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Server: Apache-Coyote/1.1&#xd;
Content-Type: text/xml;charset=UTF-8&#xd;
Transfer-Encoding: chunked&#xd;
Date: Thu, 06 Jul 2006 15:31:52 GMT&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="5" conversationID="3" type="request" timestamp="2006-07-06T10:32:06.905Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStructParam xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;varFloat&gt;5.5&lt;/varFloat&gt;&lt;varInt&gt;6565&lt;/varInt&gt;&lt;varString&gt;String Value&lt;/varString&gt;&lt;/echoStructParam&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>199.43.208.130:1153</senderHostAndPort>
<receiverHostAndPort>chathura.dyndns.ws:8080</receiverHostAndPort>
<httpHeaders>POST /axis2/services/Axis2SampleDocLitService HTTP/1.1&#xd;
User-Agent: Axis2&#xd;
SOAPAction: urn:echoStruct&#xd;
Cookie: JSESSIONID=367BC688CB59974BDD40426BD77C10B1&#xd;
Host: chathura.dyndns.ws:8080&#xd;
Transfer-Encoding: chunked&#xd;
Content-Type: text/xml; charset=UTF-8&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="6" conversationID="3" type="response" timestamp="2006-07-06T10:32:07.055Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStructReturn xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;varFloat&gt;5.5&lt;/varFloat&gt;&lt;varInt&gt;6565&lt;/varInt&gt;&lt;varString&gt;String Value&lt;/varString&gt;&lt;/echoStructReturn&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>chathura.dyndns.ws:8080</senderHostAndPort>
<receiverHostAndPort>199.43.208.130:1153</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Server: Apache-Coyote/1.1&#xd;
Content-Type: text/xml;charset=UTF-8&#xd;
Transfer-Encoding: chunked&#xd;
Date: Thu, 06 Jul 2006 15:31:57 GMT&#xd;
&#xd;
</httpHeaders>
</messageEntry>
</log>
